app/controllers/songs_controller.rb

INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2019-04-17 10:46:09.245117"], ["updated_at", "2019-04-17 10:46:09.245117"]]
INSERT INTO "songs" ("title", "created_at", "updated_at", "artist_id") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["created_at", "2019-04-17 10:46:09.246363"], ["updated_at", "2019-04-17 10:46:09.246363"], ["artist_id", 138]]
SELECT  "artists".* FROM "artists" WHERE "artists"."name" = ? LIMIT ?  [["name", ".38 Special"], ["LIMIT", 1]]
---
  def upload
    CSV.foreach(params[:songs_f].path, headers: true) do |song|
      Song.create(title: song[0],
                  artist: Artist.find_or_create_by(name: song[1]),
                  last_name: song[2])